lib/tasks/release.rake

  task :check => :environment do
    Repository.all.each do |repo|
---
SELECT `repositories`.* FROM `repositories`