app/views/notifications/_form.html.erb

SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`id` = 1 LIMIT 1
---
      <div style="height: 40px;">
        <%= form.select :repo_type, options_for_select(Notification.sorted_options_for_select, selected: @notification.repo_type, disabled: disabled_repo_entries), {}, { data: {action:"change->notification#showHideRepoField"}} %>