app/controllers/notifications_controller.rb

    def index
        @notifications = Notification.order(:name)
---
SELECT `notifications`.* FROM `notifications` ORDER BY `notifications`.`name` ASC

    def create
        @notification = Notification.new
        @notification.attributes = notification_params
        if @notification.save
---
INSERT INTO `notifications` (`name`, `repo_type`, `repo`, `email`, `webhook_url`, `webhook_method`, `webhook_content_type`, `webhook_payload`, `last_release`, `account_id`, `repository_id`, `created_at`, `updated_at`, `stop_words`) VALUES ('test', 0, 'mozilla/firefox', '', '', NULL, '', '', NULL, NULL, 1, '2025-11-01 13:27:35.664012', '2025-11-01 13:27:35.664012', '')

    def update
        @notification = Notification.find_by_hashid(params[:id]) rescue nil
        if @notification.update(notification_params)
---
UPDATE `notifications` SET `notifications`.`repo_type` = 12, `notifications`.`repo` = 'wrong_repo/format', `notifications`.`repository_id` = 2, `notifications`.`updated_at` = '2025-12-03 10:15:03.325829' WHERE `notifications`.`id` = 1

    def destroy
        @notification = Notification.find_by_hashid(params[:id]) rescue nil
        if @notification.destroy
---
DELETE FROM `notifications` WHERE `notifications`.`id` = 3