app/models/notification.rb

SELECT `repositories`.* FROM `repositories` WHERE `repositories`.`repo_type` = 0 AND `repositories`.`repo` = 'mozilla/firefox' LIMIT 1
INSERT INTO `repositories` (`repo_type`, `repo`, `last_release`, `last_checked`, `created_at`, `updated_at`) VALUES (0, 'mozilla/firefox', NULL, NULL, '2025-11-01 13:27:35.656954', '2025-11-01 13:27:35.656954')
---
    def set_repository
        self.normalize_repo
        repo = Repository.find_by(repo_type: self.repo_type, repo: self.repo)
        if repo.nil?
            repo = Repository.create(repo_type: self.repo_type, repo: self.repo)

UPDATE `notifications` SET `notifications`.`last_release` = 'FIREFOX-ANDROID_145_0b9_RELEASE: No Bug - Bumping Mobile l10n changesets r=release a=l10n-bump', `notifications`.`updated_at` = '2025-11-01 13:40:36.540636' WHERE `notifications`.`id` = 1
---
    def notify(link)
        if !self.email.blank?
            NotificationMailer.notify_mail(self, link).deliver if BlockedMail.where(mail_address: self.email).count == 0
        end
        if !self.webhook_url.blank? && !self.webhook_method.blank?
            self.send_to_webhook(link)
        end
        self.update(last_release: self.repository.last_release )